use lab;

set foreign_key_checks =0;

truncate table university;

SET foreign_key_checks =1;

CREATE TABLE u_temp (
id SMALLINT UNSIGNED NOT NULL AUTO_INCREMENT,
university_name VARCHAR(120) NULL,
PRIMARY KEY (id));

INSERT INTO u_temp(university_name) values 
('Барановичский государственный университет'),
('Брестский государственный технический университет'),
('Брестсuniverкий государственный университет имени А.С.Пушкина'),
('Полесский государственный университет'),
('Витебская ордена «Знак Почёта» государственная академия ветеринарной медицины'),
('Витебский государственный ордена Дружбы народов медицинский университет'),
('Витебский государственный технологический университет'),
('Витебский государственный университет имени П. М. Машерова'),
('Витебский филиал Международного университета "МИТСО"'),
('Полоцкий государственный университет'),
('Белорусский государственный университет транспорта'),
('Белорусский торгово-экономический университет потребительской кооперации'),
('Гомельский государственный медицинский университет'),
('Гомельский государственный технический университет им. П.О. Сухого'),
('Гомельский государственный университет им. Франциска Скорины'),
('Гомельский филиал Международного университета "МИТСО"'),
('Мозырский государственный педагогический университет имени И.П. Шамякина'),
('Гродненский государственный аграрный университет'),
('Гродненский государственный медицинский университет'),
('Гродненский государственный университет имени Янки Купалы'),
('Гродненский филиал БИП'),
('Академия Министерства внутренних дел Республики Беларусь'),
('Академия управления при Президенте Республики Беларусь'),
('Белорусская государственная академия авиации'),
('Белорусская государственная академия искусств'),
('Белорусская государственная академия музыки'),
('Белорусская государственная академия связи'),
('Белорусский государственный аграрный технический университет'),
('Белорусский государственный медицинский университет'),
('Белорусский государственный педагогический университет им. Максима Танка'),
('Белорусский государственный технологический университет'),
('Белорусский государственный университет'),
('Белорусский государственный университет информатики и радиоэлектроники'),
('Белорусский государственный университет культуры и искусств'),
('Белорусский государственный университет физической культуры'),
('Белорусский государственный экономический университет'),
('Белорусский национальный технический университет'),
('Военная академия Республики Беларусь'),
('Государственное учреждение образования «Институт пограничной службы Республики Беларусь»'),
('ГУО «Институт бизнеса БГУ»'),
('Институт менеджмента спорта и туризма'),
('Институт парламентаризма и предпринимательства'),
('Институт современных знаний имени А.М.Широкова'),
('Международный государственный экологический институт имени А.Д.Сахарова Белорусского государственного университета'),
('Международный гуманитарно-экономический институт'),
('Международный университет "МИТСО"'),
('Минский государственный лингвистический университет'),
('Минский инновационный университет'),
('Университет гражданской защиты Министерства по чрезвычайным ситуациям Республики Беларусь'),
('УО "Частный институт управления и предпринимательства"'),
('Учреждение образования” Институт предпринимательской деятельности“ (ИПД)'),
('Филиал БНТУ г. Солигорск'),
('Частное учреждение образования «БИП-Институт правоведения»'),
('Могилев и Могилевская область'),
('Белорусская государственная орденов Октябрьской Революции и Трудового Красного Знамени сельскохозяйственная академия'),
('Белорусско-Российский университет'),
('Могилевский государственный университет имени А. А. Кулешова'),
('Могилевский государственный университет продовольствия'),
('Могилевский институт Министерства внутренних дел Республики Беларусь');

INSERT INTO university(id, university_name) SELECT row_number() OVER (ORDER BY
university_name) row_num, university_name FROM u_temp;

DROP TABLE u_temp;